tap "aws/tap"
tap "filosottile/gomod"
tap "github/gh"
tap "golangci/tap"
tap "heroku/brew"
brew "asdf"
brew "aws-vault"
brew "awscli"
brew "gdbm"
brew "python@3.10"
brew "awslogs"
brew "ca-certificates"
brew "cheat"
brew "cjson"
brew "cmake"
brew "cmocka"
brew "libunistring"
brew "guile"
brew "libevent"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libusb"
brew "lz4"
brew "snappy"
brew "zstd"
brew "colima"
brew "coreutils"
brew "ctags"
brew "dav1d"
brew "difftastic"
brew "docbook"
brew "docbook-xsl"
brew "docker"
brew "git"
brew "git-extras"
brew "gnu-getopt", link: true
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci/tap/golangci-lint"
brew "graphviz"
brew "heroku/brew/heroku"
brew "hub"
brew "icu4c", link: true
brew "jq"
brew "krb5", link: true
brew "libpq"
brew "neovim"
brew "readline"
brew "redis", restart_service: true
brew "ripgrep"
brew "shared-mime-info"
brew "sqlite", link: true
brew "tree"
brew "unzip"
brew "wget"
cask "1password@beta"
cask "1password-cli"
cask "appcleaner"
cask "backblaze"
cask "dynamodb-local"
cask "discord"
cask "dropbox"
cask "iterm2"
cask "keybase"
cask "muzzle"
cask "obsidian"
cask "postman"
cask "proxyman"
cask "raycast"
cask "remarkable"
cask "gitx"
cask "notion-calendar"
cask "secretive"
cask "shiftit"
cask "signal"
cask "slack@beta"
cask "sonos"
cask "spotify"
cask "zulu@17"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
