tap "aws/tap"
tap "filosottile/gomod"
tap "github/gh"
tap "golangci/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "brotli"
brew "giflib"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "libtiff"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "m4", link: true
brew "autoconf"
brew "automake"
brew "ca-certificates"
brew "gmp"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "openssl@1.1"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "aws-vault"
brew "mpdecimal"
brew "sqlite", link: true
brew "xz"
brew "six"
brew "awscli"
brew "gdbm"
brew "python@3.10"
brew "awslogs"
brew "bash-completion"
brew "bash-git-prompt"
brew "bdw-gc"
brew "blueutil"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "pkg-config"
brew "libpthread-stubs"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pcre"
brew "pixman"
brew "cairo"
brew "chamber"
brew "cheat"
brew "cjson"
brew "cmake"
brew "cmocka"
brew "libunistring"
brew "guile"
brew "libevent"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libusb"
brew "lz4"
brew "snappy"
brew "zstd"
brew "colima"
brew "cscope"
brew "ctags"
brew "dav1d"
brew "difftastic"
brew "docbook"
brew "docbook-xsl"
brew "docker"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "graphite2"
brew "icu4c", link: true
brew "harfbuzz"
brew "lame"
brew "little-cms2"
brew "openjpeg"
brew "leptonica"
brew "libb2"
brew "libarchive", link: true
brew "libass"
brew "libbluray"
brew "mbedtls"
brew "librist"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsamplerate"
brew "libsodium"
brew "libsoxr"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "speex"
brew "srt"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-extras"
brew "gnu-getopt", link: true
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "gosec"
brew "jasper"
brew "netpbm"
brew "gts"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hub"
brew "jansson"
brew "oniguruma"
brew "jq"
brew "krb5", link: true
brew "libpq"
brew "lua"
brew "neovim"
brew "ruby", link: true
brew "macvim"
brew "mtr"
brew "redis", restart_service: true
brew "ripgrep"
brew "xmlto"
brew "shared-mime-info"
brew "telnet"
brew "testssl"
brew "tree"
brew "unzip"
brew "wget"
brew "youtube-dl"
brew "filosottile/gomod/brew-gomod"
brew "golangci/tap/golangci-lint"
brew "heroku/brew/heroku-node", link: true
brew "heroku/brew/heroku"
cask "1password-cli"
cask "appcleaner"
cask "backblaze"
cask "cron"
cask "dynamodb-local"
cask "dynobase"
cask "google-chrome"
cask "grammarly"
cask "iterm2"
cask "keybase"
cask "keycastr"
cask "loom"
cask "muzzle"
cask "obsidian"
cask "postgres"
cask "postman"
cask "proxyman"
cask "raycast"
cask "remarkable"
cask "rowanj-gitx"
cask "secretive"
cask "shiftit"
cask "signal"
cask "sketch"
cask "slack-beta"
cask "sonos"
cask "spotify"
cask "sunsama"
cask "temurin"
cask "temurin8"
cask "typora"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
